Ran Plan for dir: `vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_subnetwork.atlantis_demo_subnetwork must be replaced
-/+ resource "google_compute_subnetwork" "atlantis_demo_subnetwork" {
      ~ creation_timestamp         = "2023-11-13T06:03:05.310-08:00" -> (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      ~ gateway_address            = "10.10.0.1" -> (known after apply)
      ~ id                         = "projects/premium-guide-403909/regions/europe-central2/subnetworks/atlantis-demo-subnetwork" -> (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ipv6_cidr_range            = (known after apply)
      ~ name                       = "atlantis-demo-subnetwork" -> "atlantis-demo-subnetwornewpr" # forces replacement
      ~ network                    = "https://www.googleapis.com/compute/v1/projects/premium-guide-403909/global/networks/atlantis-demo-network" -> "projects/premium-guide-403909/global/networks/atlantis-demo-network"
      ~ private_ip_google_access   = false -> (known after apply)
      ~ private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> (known after apply)
      ~ purpose                    = "PRIVATE" -> (known after apply)
      ~ secondary_ip_range         = [] -> (known after apply)
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/premium-guide-403909/regions/europe-central2/subnetworks/atlantis-demo-subnetwork" -> (known after apply)
      ~ stack_type                 = "IPV4_ONLY" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.118.115.250/lock?id=devabolmasov%252Fatlantis%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`